hkchengrex/robocon-f4-lib/STM32F405VG/ext/spi_xbc_mb.h
#ifndef __SPI_XBC_MB_H
#define __SPI_XBC_MB_H

#include "stm32f4xx.h"
#include "spi_protocol.h"
#include "gpio.h"
#include "xbc_mb.h"
#include "ticks.h"
#include "lcd_main.h"

#define SPI_XBC_PORT SPI3

//Min time between interrupts triggered to count as disconnection
#define SPI_XBC_CONNECTION_TIMEOUT_MS   100

//SPI XBC MISO command list
#define SPI_REPLY		0x50
#define SPI_NO_USB	0x51

//SPI XBC MOSI command list
#define SPI_TFT			0x70
#define SPI_CTRL		0x71

//SPI XBC receiver states
typedef enum {
	SPI_RX_XBC_CMD,	//Incoming command
	SPI_RX_XBC_DATA	//Incoming XBC button data
} SPI_RX_XBC_STATE;

//SPI connection states
typedef enum {
  SPI_XBC_DISCONNECTED,		//XBC board disconnected
  SPI_XBC_USB_DISCONNECTED,	//XBC board connected, but its USB port is disconnected
  SPI_XBC_ALL_CONNECTED		//XBC board and controller connected
} SPI_XBC_CONNECTION_MODE;

typedef enum {
	SPI_XBC_TX_DISABLE,
	SPI_XBC_TX_ENABLE
} SPI_XBC_TX_STATE;

typedef struct {
  u16 color, bg_color;
  char text;
} XBC_LCD_DATA;

void spi_xbc_mb_init(void);
SPI_XBC_CONNECTION_MODE spi_xbc_get_connection(void);
u32 spi_xbc_get_digital(void);
s16 spi_xbc_get_joy_raw(XBC_JOY j);
s16 spi_xbc_get_joy(XBC_JOY j);
u16 spi_xbc_get_back_buttons(void);
void spi_xbc_mb_lcd_tx(void);
void spi_xbc_rx_handler(uc8 data);

#endif  /** __SPI_XBC_MB_H **/
